recipes/focaccia.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Focaccia</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../static/recipe.css" />
<link rel="icon" type="image/ico" href="../static/favicon.svg" />
</head>
<body>
<div id="org-div-home-and-up"> <a href="../index.html"> Home </a> </div> <div id="btns"><button id="copy-btn" onclick="copyTicked()"></button> <button id="untick-btn" onclick="untickAll()"></button></div><div id="notify">Copied!</div><div id="content" class="content">
<h1 class="title">Focaccia</h1>
<p>
<a href="https://alexandracooks.com/2018/03/02/overnight-refrigerator-focaccia-best-focaccia/">Original link</a>
</p>

<div id="outline-container-orgc0fab52" class="outline-2">
<h2 id="orgc0fab52">Ingredients</h2>
<div class="outline-text-2" id="text-orgc0fab52">
<ul class="org-ul">
<li>4 cups (512 g) all-purpose flour or bread flour, see notes above</li>
<li>2 teaspoons (10 g) kosher salt</li>
<li>2 teaspoons (8 g) instant yeast, see notes above if using active dry</li>
<li>2 cups (455 g) lukewarm water, made by combining 1/2 cup boiling water with 1 1/2 cups cold water butter for greasing</li>
<li>4 tablespoons olive oil, divided flaky sea salt, such as Maldon</li>
<li>1 to 2 teaspoons whole rosemary leaves, optional</li>
</ul>
</div>
</div>

<div id="outline-container-org456a257" class="outline-2">
<h2 id="org456a257">Instructions</h2>
<div class="outline-text-2" id="text-org456a257">
<ol class="org-ol">
<li>In a large bowl whisk together flour, salt and instant yeast. Add the water and mix using spatula until all liquid is absorbed. Rub lightly with olive oil and cover with plastic wrap. Let proof in refridgerator for 12 hours to 3 days.</li>
<li>Grease a pan with margarine/cooking spray. Pour a tablespoon of olive oil into the center of pan. Release the dough with two forks, form a rough ball and place on tray.</li>
<li>Let the dough rest for 3-4 hours at room temperature.</li>
<li>Preheat over to 220&amp;deg;C. Add toppings to dough then with oil coated fingers press deep dimples into the dough. Gently stretch to fill the pan if required. Sprinkle salt.</li>
<li>Bake to 25-30 minutes until golden and crisp. Let it cool for 10 minutes before serving.</li>
</ol>
</div>
</div>
</div>
</body>
</html>
